local function games(msg)
local text = msg.content_.text_
if text == 'الالعاب' and database:get(bot_id..'Lock:Games'..msg.chat_id_) then
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,' ❂لا تستطيع استخدام البوت \n  ❂يرجى الاشتراك بالقناه اولا \n  ❂اشترك هنا ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
Text_Games = [[
 ❂ اوامر الالعاب كتالي 
 ╭—──── • ❂ • ──—–—╮
 ❂ تفعيل الالعاب • لتفعيل العبه ° 
 ❂ تعطيل الالعاب • لتعطيل العبه °
 ╰──── • ❂ • ────╯
 ❂ الالعاب الخاصه بسورس 
 ╭—──── • ❂ • ──—–—╮
 ❂ لعبه البات ➥ لعبة المحيبس 
 ❂ لعبه التخمين ➥ لعبة البحث
 ❂ لعبه الاسرع ➥ لعبة اسرع شخص
 ❂ لعبه السمايلات ➥ لعبة المطابقه 
 ❂ لعبه المختلف ➥ لعبة الذكاء
 ❂ لعبه الرياضيات ➥ لعبة الارقام
 ❂ لعبه الانكليزي ➥ لعبة ترجمه
 ❂ لعبه الامثله ➥ لعبة تصحيح 
 ❂ لعبه العكس ➥ لعبة عكس الكلمات
 ❂ لعبه الحزوره ➥لعبة التفكير 
 ❂ لعبه كت تويت ➥ العبه تويت
 ╭—──── • ❂ • ──—–—╮
 ➢[𝐬𝐨𝐮𝐫𝐜𝐞 𝐚𝐥𝐚𝐳𝐢𝐳𝐲 ❂](t.me/al_aziza1)
[➣مبرمج السورس❂](t.me/alazizy)
╰──── • ❂ • ────╯
]]
send(msg.chat_id_, msg.id_,Text_Games) 
end

if text == 'السمايلات' or text == 'السمايل' then
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,' ❂لا تستطيع استخدام البوت \n  ❂يرجى الاشتراك بالقناه اولا \n  ❂اشترك هنا ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
if database:get(bot_id..'Lock:Games'..msg.chat_id_) then
database:del(bot_id..'Set:Sma'..msg.chat_id_)
Random = {'🍏','🍎','🍐','🍊','??','🍉','🍇','🍓','🍈','🍒','🍑','🍍','??','🥝','🍅','🍆','🥑','🥦','🥒','🌶','🌽','🥕','🥔','🥖','🥐','🍞','🥨','🍟','🧀','🥚','🍳','🥓','🥩','🍗','🍖','🌭','🍔','🍠','🍕','🥪','🥙','☕️','🍵','🥤','🍶','🍺','🍻','🏀','⚽️','🏈','⚾️','🎾','🏐','🏉','🎱','🏓','🏸','🥅','🎰','🎮','🎳','🎯','🎲','🎻','🎸','🎺','🥁','🎹','🎼','🎧','🎤','🎬','🎨','🎭','🎪','🎟','🎫','🎗','🏵','🎖','🏆','🥌','🛷','🚗','🚌','🏎','🚓','🚑','🚚','🚛','🚜','🇮🇶','⚔','🛡','🔮','🌡','💣','📌','📍','📓','📗','📂','📅','📪','📫','📬','📭','⏰','📺','🎚','☎️','📡'}
SM = Random[math.random(#Random)]
database:set(bot_id..'Random:Sm'..msg.chat_id_,SM)
send(msg.chat_id_, msg.id_,' ❂اسرع واحد يدز هاذا السمايل ? » {`'..SM..'`}')
return false
end
end
if text == ''..(database:get(bot_id..'Random:Sm'..msg.chat_id_) or '')..'' and not database:get(bot_id..'Set:Sma'..msg.chat_id_) then
if not database:get(bot_id..'Set:Sma'..msg.chat_id_) then 
send(msg.chat_id_, msg.id_,' ❂الف مبروك لقد فزت \n ❂للعب مره اخره ارسل »{ سمايل , سمايلات }')
database:incrby(bot_id..'NUM:GAMES'..msg.chat_id_..msg.sender_user_id_, 1)  
end
database:set(bot_id..'Set:Sma'..msg.chat_id_,true)
return false
end 
if text == 'اسرع' or text == 'الاسرع' or text == 'ترتيب' then
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,' ❂لا تستطيع استخدام البوت \n  ❂يرجى الاشتراك بالقناه اولا \n  ❂اشترك هنا ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
if database:get(bot_id..'Lock:Games'..msg.chat_id_) then
database:del(bot_id..'Speed:Tr'..msg.chat_id_)
KlamSpeed = {'سحور','سياره','استقبال','قنفه','ايفون','بزونه','مطبخ','كرستيانو','دجاجه','مدرسه','الوان','غرفه','ثلاجه','كهوه','سفينه','العراق','محطه','طياره','رادار','منزل','مستشفى','كهرباء','تفاحه','اخطبوط','سلمون','فرنسا','برتقاله','تفاح','مطرقه','بتيته','لهانه','شباك','باص','سمكه','ذباب','تلفاز','حاسوب','انترنيت','ساحه','جسر'};
name = KlamSpeed[math.random(#KlamSpeed)]
database:set(bot_id..'Klam:Speed'..msg.chat_id_,name)
name = string.gsub(name,'سحور','س ر و ح')
name = string.gsub(name,'سياره','ه ر س ي ا')
name = string.gsub(name,'استقبال','ل ب ا ت ق س ا')
name = string.gsub(name,'قنفه','ه ق ن ف')
name = string.gsub(name,'ايفون','و ن ف ا')
name = string.gsub(name,'بزونه','ز و ه ن')
name = string.gsub(name,'مطبخ','خ ب ط م')
name = string.gsub(name,'كرستيانو','س ت ا ن و ك ر ي')
name = string.gsub(name,'دجاجه','ج ج ا د ه')
name = string.gsub(name,'مدرسه','ه م د ر س')
name = string.gsub(name,'الوان','ن ا و ا ل')
name = string.gsub(name,'غرفه','غ ه ر ف')
name = string.gsub(name,'ثلاجه','ج ه ت ل ا')
name = string.gsub(name,'كهوه','ه ك ه و')
name = string.gsub(name,'سفينه','ه ن ف ي س')
name = string.gsub(name,'العراق','ق ع ا ل ر ا')
name = string.gsub(name,'محطه','ه ط م ح')
name = string.gsub(name,'طياره','ر ا ط ي ه')
name = string.gsub(name,'رادار','ر ا ر ا د')
name = string.gsub(name,'منزل','ن ز م ل')
name = string.gsub(name,'مستشفى','ى ش س ف ت م')
name = string.gsub(name,'كهرباء','ر ب ك ه ا ء')
name = string.gsub(name,'تفاحه','ح ه ا ت ف')
name = string.gsub(name,'اخطبوط','ط ب و ا خ ط')
name = string.gsub(name,'سلمون','ن م و ل س')
name = string.gsub(name,'فرنسا','ن ف ر س ا')
name = string.gsub(name,'برتقاله','ر ت ق ب ا ه ل')
name = string.gsub(name,'تفاح','ح ف ا ت')
name = string.gsub(name,'مطرقه','ه ط م ر ق')
name = string.gsub(name,'بتيته','ب ت ت ي ه')
name = string.gsub(name,'لهانه','ه ن ل ه ل')
name = string.gsub(name,'شباك','ب ش ا ك')
name = string.gsub(name,'باص','ص ا ب')
name = string.gsub(name,'سمكه','ك س م ه')
name = string.gsub(name,'ذباب','ب ا ب ذ')
name = string.gsub(name,'تلفاز','ت ف ل ز ا')
name = string.gsub(name,'حاسوب','س ا ح و ب')
name = string.gsub(name,'انترنيت','ا ت ن ر ن ي ت')
name = string.gsub(name,'ساحه','ح ا ه س')
name = string.gsub(name,'جسر','ر ج س')
send(msg.chat_id_, msg.id_,' ❂اسرع واحد يرتبها » {'..name..'}')
return false
end
end
------------------------------------------------------------------------
if text == ''..(database:get(bot_id..'Klam:Speed'..msg.chat_id_) or '')..'' and not database:get(bot_id..'Speed:Tr'..msg.chat_id_) then
if not database:get(bot_id..'Speed:Tr'..msg.chat_id_) then 
send(msg.chat_id_, msg.id_,' ❂الف مبروك لقد فزت \n ❂للعب مره اخره ارسل »{ الاسرع , ترتيب }')
database:incrby(bot_id..'NUM:GAMES'..msg.chat_id_..msg.sender_user_id_, 1)  
end
database:set(bot_id..'Speed:Tr'..msg.chat_id_,true)
end 

if text == 'الحزوره' or text == 'حزوره' then
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,' ❂لا تستطيع استخدام البوت \n  ❂يرجى الاشتراك بالقناه اولا \n  ❂اشترك هنا ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
if database:get(bot_id..'Lock:Games'..msg.chat_id_) then
database:del(bot_id..'Set:Hzora'..msg.chat_id_)
Hzora = {'الجرس','عقرب الساعه','السمك','المطر','5','الكتاب','البسمار','7','الكعبه','بيت الشعر','لهانه','انا','امي','الابره','الساعه','22','غلط','كم الساعه','البيتنجان','البيض','المرايه','الضوء','الهواء','الضل','العمر','القلم','المشط','الحفره','البحر','الثلج','الاسفنج','الصوت','بلم'};
name = Hzora[math.random(#Hzora)]
database:set(bot_id..'Klam:Hzor'..msg.chat_id_,name)
name = string.gsub(name,'الجرس','شيئ اذا لمسته صرخ ما هوه ؟')
name = string.gsub(name,'عقرب الساعه','اخوان لا يستطيعان تمضيه اكثر من دقيقه معا فما هما ؟')
name = string.gsub(name,'السمك','ما هو الحيوان الذي لم يصعد الى سفينة نوح عليه السلام ؟')
name = string.gsub(name,'المطر','شيئ يسقط على رأسك من الاعلى ولا يجرحك فما هو ؟')
name = string.gsub(name,'5','ما العدد الذي اذا ضربته بنفسه واضفت عليه 5 يصبح ثلاثين ')
name = string.gsub(name,'الكتاب','ما الشيئ الذي له اوراق وليس له جذور ؟')
name = string.gsub(name,'البسمار','ما هو الشيئ الذي لا يمشي الا بالضرب ؟')
name = string.gsub(name,'7','عائله مؤلفه من 6 بنات واخ لكل منهن .فكم عدد افراد العائله ')
name = string.gsub(name,'الكعبه','ما هو الشيئ الموجود وسط مكة ؟')
name = string.gsub(name,'بيت الشعر','ما هو البيت الذي ليس فيه ابواب ولا نوافذ ؟ ')
name = string.gsub(name,'لهانه','وحده حلوه ومغروره تلبس مية تنوره .من هيه ؟ ')
name = string.gsub(name,'انا','ابن امك وابن ابيك وليس باختك ولا باخيك فمن يكون ؟')
name = string.gsub(name,'امي','اخت خالك وليست خالتك من تكون ؟ ')
name = string.gsub(name,'الابره','ما هو الشيئ الذي كلما خطا خطوه فقد شيئا من ذيله ؟ ')
name = string.gsub(name,'الساعه','ما هو الشيئ الذي يقول الصدق ولكنه اذا جاع كذب ؟')
name = string.gsub(name,'22','كم مره ينطبق عقربا الساعه على بعضهما في اليوم الواحد ')
name = string.gsub(name,'غلط','ما هي الكلمه الوحيده التي تلفض غلط دائما ؟ ')
name = string.gsub(name,'كم الساعه','ما هو السؤال الذي تختلف اجابته دائما ؟')
name = string.gsub(name,'البيتنجان','جسم اسود وقلب ابيض وراس اخظر فما هو ؟')
name = string.gsub(name,'البيض','ماهو الشيئ الذي اسمه على لونه ؟')
name = string.gsub(name,'المرايه','ارى كل شيئ من دون عيون من اكون ؟ ')
name = string.gsub(name,'الضوء','ما هو الشيئ الذي يخترق الزجاج ولا يكسره ؟')
name = string.gsub(name,'الهواء','ما هو الشيئ الذي يسير امامك ولا تراه ؟')
name = string.gsub(name,'الضل','ما هو الشيئ الذي يلاحقك اينما تذهب ؟ ')
name = string.gsub(name,'العمر','ما هو الشيء الذي كلما طال قصر ؟ ')
name = string.gsub(name,'القلم','ما هو الشيئ الذي يكتب ولا يقرأ ؟')
name = string.gsub(name,'المشط','له أسنان ولا يعض ما هو ؟ ')
name = string.gsub(name,'الحفره','ما هو الشيئ اذا أخذنا منه ازداد وكبر ؟')
name = string.gsub(name,'البحر','ما هو الشيئ الذي يرفع اثقال ولا يقدر يرفع مسمار ؟')
name = string.gsub(name,'الثلج','انا ابن الماء فان تركوني في الماء مت فمن انا ؟')
name = string.gsub(name,'الاسفنج','كلي ثقوب ومع ذالك احفض الماء فمن اكون ؟')
name = string.gsub(name,'الصوت','اسير بلا رجلين ولا ادخل الا بالاذنين فمن انا ؟')
name = string.gsub(name,'بلم','حامل ومحمول نصف ناشف ونصف مبلول فمن اكون ؟ ')
send(msg.chat_id_, msg.id_,' ❂اسرع واحد يحل الحزوره ↓\n {'..name..'}')
return false
end
end
------------------------------------------------------------------------
if text == ''..(database:get(bot_id..'Klam:Hzor'..msg.chat_id_) or '')..'' and not database:get(bot_id..'Set:Hzora'..msg.chat_id_) then
if not database:get(bot_id..'Set:Hzora'..msg.chat_id_) then 
send(msg.chat_id_, msg.id_,' ❂الف مبروك لقد فزت \n ❂للعب مره اخره ارسل »{ حزوره }')
database:incrby(bot_id..'NUM:GAMES'..msg.chat_id_..msg.sender_user_id_, 1)  
end
database:set(bot_id..'Set:Hzora'..msg.chat_id_,true)
end 

if text == "تعطيل معاني الاسماء" and Manager(msg) then
send(msg.chat_id_, msg.id_, '⋆ ⇽ تم تعطيل معاني الاسماء')
database:set(bot_id.."boyka:Name_Bots"..msg.chat_id_,"close")
end
if text == "تفعيل معاني الاسماء" and Manager(msg) then
send(msg.chat_id_, msg.id_,'⋆ ⇽ تم تفعيل معاني الاسماء')
database:set(bot_id.."boyka:Name_Bots"..msg.chat_id_,"open")
end
if text and text:match("^معني (.*)$") and database:get(bot_id.."boyka:Name_Bots"..msg.chat_id_) == "open" then
local TextName = text:match("^معني (.*)$")
gk = https.request('http://sonicx.ml/Api/Name.php?Name='..URL.escape(TextName)..'')
br = JSON.decode(gk)
send(msg.chat_id_, msg.id_,br.meaning)
end

if text == 'كت تويت' or text == 'تويت' then
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,' ❂لا تستطيع استخدام البوت \n  ❂يرجى الاشتراك بالقناه اولا \n  ❂اشترك هنا ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
if database:get(bot_id..'Lock:Games'..msg.chat_id_) then
database:del(bot_id..'Set:Maany'..msg.chat_id_)
Maany_Rand =
{' كم مره حبيت؟','نسبه الندم عندك للي وثقت فيهم ؟','نسبة النعاس عندك حاليًا؟','اكثر ممثل تحبه ؟','قد تخيلت شي في بالك وصار ؟','وش أخر شي ضيعته؟','ما السيء في هذه الحياة ؟','كلمة لشخص أسعدك رغم حزنك في يومٍ من الأيام ؟','عادي تتجوز من برا بلدك؟','شيء عندك اهم من الناس ؟','تفضّل النقاش الطويل او تحب الاختصار','اجمل حاجه حصلتلك هي اي؟','عندك كراش؟','اكثر المتابعين عندك باي برنامج؟','لما صحبك يقولك انت مالك بتعمل اي ؟','اسم اول شخص عرفته فتيلجرام ؟','تجامل الناس ولا اللي بقلبك على لسانك؟','جربت شعور احد يحبك بس انت مو قادر تحبه؟','عمرك ضحيت بحاجه عشان شخص ميستهلش ؟','اسم مغني كله بيحبه ومش عاجبك نت ؟','كم في حسابك البنكي ؟','سؤال ينرفزك ؟','الفلوس او الحب ؟','آخر غلطات عمرك؟','مسلسل كرتوني له ذكريات جميلة عندك؟','ما أكثر تطبيق تقضي وقتك عليه؟','نسبه حبك للبوت دا قد اي؟','مين قدوتك في الحياه؟','اي موصفات حبيبك؟','أكثر حيوان تخاف منه؟','مرتبط ولا سنجل ؟','إيموجي يعبّر عن مزاجك الحالي؟','أكثر تغيير ترغب أن تغيّره في نفسك؟','أكثر شيء أسعدك اليوم؟','بماذا يتعافى المرء؟','ما هو أفضل حافز للشخص؟','آخر شيء ندمت عليه؟','اكتر فلم بتحبه؟','رد فعلك للردود المتاخره؟','اي رائيك في سورس العزايزي؟','كلمة لشخص بعيد؟','صفة يطلقها عليك الشخص المفضّل؟','أغنية عالقة في ذهنك هاليومين؟','أكلة مستحيل أن تأكلها؟','كيف قضيت نهارك؟','تصرُّف ماتتحمله؟','ماذا لو عاد معتذراً؟','تقطع علاقتك بالشخص إذا عرفت إنه؟','كلام ودك يوصل للشخص المطلوب ؟','ردة فعلك لمن يتجاهلك بالرد متعمد؟','بتواجه المشاكل ولا بتهرب منها؟','أمنية كنت تتمناها وحققتها ؟','تملك وسواس من شيء معين ؟','عمرك انتقمت من أحد ؟','متى تقرر تنسحب من أي علاقة ؟','كلمتين تكررها دايم ؟','افضل هديه ممكن تناسبك؟','موقف خلاك تحس انك مكسور ؟','وانت حزين اول شخص تتصل عليه؟','ماذا لو كانت مشاعر البشر مرئية ؟','يهمك ظن الناس فيك ولا ؟','موقف غير حياتك؟','اكثر مشروب تحبه؟','القصيدة اللي تأثر فيك؟','متى يصبح الصديق غريب','وين نلقى السعاده برايك؟','قهوه و لا شاي؟','من محبّين الليل أو الصبح؟','وين نلقى السعاده برايك؟','اسم ماتحبه ؟','وش الحب بنظرك؟'}
name = Maany_Rand[math.random(#Maany_Rand)]
database:set(bot_id..'Maany'..msg.chat_id_,name)
name = string.gsub(name,'قرد','🐒')
name = string.gsub(name,'دجاجه','🐔')
name = string.gsub(name,'بطريق','🐧')
name = string.gsub(name,'ضفدع','🐸')
name = string.gsub(name,'بومه','🦉')
name = string.gsub(name,'نحله','🐝')
name = string.gsub(name,'ديك','🐓')
name = string.gsub(name,'جمل','🐫')
name = string.gsub(name,'بقره','🐄')
name = string.gsub(name,'دولفين','??')
name = string.gsub(name,'تمساح','🐊')
name = string.gsub(name,'قرش','🦈')
name = string.gsub(name,'نمر','🐅')
name = string.gsub(name,'اخطبوط','🐙')
name = string.gsub(name,'سمكه','🐟')
name = string.gsub(name,'خفاش','🦇')
name = string.gsub(name,'اسد','🦁')
name = string.gsub(name,'فأر','🐭')
name = string.gsub(name,'ذئب','🐺')
name = string.gsub(name,'فراشه','🦋')
name = string.gsub(name,'عقرب','🦂')
name = string.gsub(name,'زرافه','🦒')
name = string.gsub(name,'قنفذ','🦔')
name = string.gsub(name,'تفاحه','🍎')
name = string.gsub(name,'باذنجان','🍆')
send(msg.chat_id_, msg.id_,' ❂» {'..name..'}')
return false
end
end
------------------------------------------------------------------------
if text == ''..(database:get(bot_id..'Maany'..msg.chat_id_) or '')..'' and not database:get(bot_id..'Set:Maany'..msg.chat_id_) then
if not database:get(bot_id..'Set:Maany'..msg.chat_id_) then 
send(msg.chat_id_, msg.id_,' ❂ الف مبروك لقد فزت \n ❂للعب مره اخره ارسل »{ معاني }')
database:incrby(bot_id..'NUM:GAMES'..msg.chat_id_..msg.sender_user_id_, 1)  
end
database:set(bot_id..'Set:Maany'..msg.chat_id_,true)
end 
if text == 'العكس' or text == 'عكس' then
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,' ❂لا تستطيع استخدام البوت \n  ❂يرجى الاشتراك بالقناه اولا \n  ❂اشترك هنا ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
if database:get(bot_id..'Lock:Games'..msg.chat_id_) then
database:del(bot_id..'Set:Aks'..msg.chat_id_)
katu = {'باي','فهمت','موزين','اسمعك','احبك','موحلو','نضيف','حاره','ناصي','جوه','سريع','ونسه','طويل','سمين','ضعيف','شريف','شجاع','رحت','عدل','نشيط','شبعان','موعطشان','خوش ولد','اني','هادئ'}
name = katu[math.random(#katu)]
database:set(bot_id..'Set:Aks:Game'..msg.chat_id_,name)
name = string.gsub(name,'باي','هلو')
name = string.gsub(name,'فهمت','مافهمت')
name = string.gsub(name,'موزين','زين')
name = string.gsub(name,'اسمعك','ماسمعك')
name = string.gsub(name,'احبك','ماحبك')
name = string.gsub(name,'موحلو','حلو')
name = string.gsub(name,'نضيف','وصخ')
name = string.gsub(name,'حاره','بارده')
name = string.gsub(name,'ناصي','عالي')
name = string.gsub(name,'جوه','فوك')
name = string.gsub(name,'سريع','بطيء')
name = string.gsub(name,'ونسه','ضوجه')
name = string.gsub(name,'طويل','قزم')
name = string.gsub(name,'سمين','ضعيف')
name = string.gsub(name,'ضعيف','قوي')
name = string.gsub(name,'شريف','كواد')
name = string.gsub(name,'شجاع','جبان')
name = string.gsub(name,'رحت','اجيت')
name = string.gsub(name,'عدل','ميت')
name = string.gsub(name,'نشيط','كسول')
name = string.gsub(name,'شبعان','جوعان')
name = string.gsub(name,'موعطشان','عطشان')
name = string.gsub(name,'خوش ولد','موخوش ولد')
name = string.gsub(name,'اني','مطي')
name = string.gsub(name,'هادئ','عصبي')
send(msg.chat_id_, msg.id_,' ❂اسرع واحد يدز العكس » {'..name..'}')
return false
end
end
------------------------------------------------------------------------
if text == ''..(database:get(bot_id..'Set:Aks:Game'..msg.chat_id_) or '')..'' and not database:get(bot_id..'Set:Aks'..msg.chat_id_) then
if not database:get(bot_id..'Set:Aks'..msg.chat_id_) then 
send(msg.chat_id_, msg.id_,' ❂الف مبروك لقد فزت \n ❂للعب مره اخره ارسل »{ العكس }')
database:incrby(bot_id..'NUM:GAMES'..msg.chat_id_..msg.sender_user_id_, 1)  
end
database:set(bot_id..'Set:Aks'..msg.chat_id_,true)
end 

if database:get(bot_id.."GAME:TKMEN" .. msg.chat_id_ .. "" .. msg.sender_user_id_) then  
if text and text:match("^(%d+)$") then
local NUM = text:match("^(%d+)$")
if tonumber(NUM) > 20 then
send(msg.chat_id_, msg.id_," ❂عذرآ لا يمكنك تخمين عدد اكبر من ال { 20 } خمن رقم ما بين ال{ 1 و 20 }\n")
return false  end 
local GETNUM = database:get(bot_id.."GAMES:NUM"..msg.chat_id_)
if tonumber(NUM) == tonumber(GETNUM) then
database:del(bot_id..'SADD:NUM'..msg.chat_id_..msg.sender_user_id_)
database:del(bot_id.."GAME:TKMEN" .. msg.chat_id_ .. "" .. msg.sender_user_id_)   
database:incrby(bot_id..'NUM:GAMES'..msg.chat_id_..msg.sender_user_id_,5)  
send(msg.chat_id_, msg.id_,' ❂مبروك فزت ويانه وخمنت الرقم الصحيح\n ❂تم اضافة { 5 } من النقاط \n')
elseif tonumber(NUM) ~= tonumber(GETNUM) then
database:incrby(bot_id..'SADD:NUM'..msg.chat_id_..msg.sender_user_id_,1)
if tonumber(database:get(bot_id..'SADD:NUM'..msg.chat_id_..msg.sender_user_id_)) >= 3 then
database:del(bot_id..'SADD:NUM'..msg.chat_id_..msg.sender_user_id_)
database:del(bot_id.."GAME:TKMEN" .. msg.chat_id_ .. "" .. msg.sender_user_id_)   
send(msg.chat_id_, msg.id_,' ❂اوبس لقد خسرت في اللعبه \n ❂حظآ اوفر في المره القادمه \n ❂كان الرقم الذي تم تخمينه { '..GETNUM..' }')
else
send(msg.chat_id_, msg.id_,' ❂اوبس تخمينك غلط \n ❂ارسل رقم تخمنه مره اخرى ')
end
end
end
end
if text == 'خمن' or text == 'التخمين' then   
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,' ❂لا تستطيع استخدام البوت \n  ❂يرجى الاشتراك بالقناه اولا \n  ❂اشترك هنا ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
if database:get(bot_id..'Lock:Games'..msg.chat_id_) then
Num = math.random(1,20)
database:set(bot_id.."GAMES:NUM"..msg.chat_id_,Num) 
send(msg.chat_id_, msg.id_,'\n ❂اهلا بك عزيزي في لعبة التخمين :\nٴ━━━━━━━━━━\n'..' ❂ملاحظه لديك { 3 } محاولات فقط فكر قبل ارسال تخمينك \n\n'..' ❂سيتم تخمين عدد ما بين ال {1 و 20} اذا تعتقد انك تستطيع الفوز جرب واللعب الان ؟ ')
database:setex(bot_id.."GAME:TKMEN" .. msg.chat_id_ .. "" .. msg.sender_user_id_, 100, true)  
return false  
end
end

if database:get(bot_id.."SET:GAME" .. msg.chat_id_ .. "" .. msg.sender_user_id_) then  
if text and text:match("^(%d+)$") then
local NUM = text:match("^(%d+)$")
if tonumber(NUM) > 6 then
send(msg.chat_id_, msg.id_," ❂عذرا لا يوجد سواء { 6 } اختيارات فقط ارسل اختيارك مره اخرى\n")
return false  end 
local GETNUM = database:get(bot_id.."Games:Bat"..msg.chat_id_)
if tonumber(NUM) == tonumber(GETNUM) then
database:del(bot_id.."SET:GAME" .. msg.chat_id_ .. "" .. msg.sender_user_id_)   
send(msg.chat_id_, msg.id_,' ❂مبروك فزت وطلعت المحيبس بل ايد رقم { '..NUM..' }\n ❂لقد حصلت على { 3 }من نقاط يمكنك استبدالهن برسائل ')
database:incrby(bot_id..'NUM:GAMES'..msg.chat_id_..msg.sender_user_id_,3)  
elseif tonumber(NUM) ~= tonumber(GETNUM) then
database:del(bot_id.."SET:GAME" .. msg.chat_id_ .. "" .. msg.sender_user_id_)   
send(msg.chat_id_, msg.id_,' ❂للاسف لقد خسرت \n ❂المحيبس بل ايد رقم { '..GETNUM..' }\n ❂حاول مره اخرى للعثور على المحيبس')
end
end
end

if text == 'محيبس' or text == 'البات' then
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,' ❂لا تستطيع استخدام البوت \n  ❂يرجى الاشتراك بالقناه اولا \n  ❂اشترك هنا ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
if database:get(bot_id..'Lock:Games'..msg.chat_id_) then   
Num = math.random(1,6)
database:set(bot_id.."Games:Bat"..msg.chat_id_,Num) 
TEST = [[
*➀       ➁     ➂      ➃      ➄     ➅
↓      ↓     ↓      ↓     ↓     ↓   
👊 ‹•› 👊 ‹•› 👊 ‹•› 👊 ‹•› 👊 ‹•› 👊
 ❂اختر لأستخراج المحيبس الايد التي تحمل المحيبس 
 ❂الفائز يحصل على { 3 } من النقاط *
]]
send(msg.chat_id_, msg.id_,TEST)
database:setex(bot_id.."SET:GAME" .. msg.chat_id_ .. "" .. msg.sender_user_id_, 100, true)  
return false  
end
end

------------------------------------------------------------------------
if text == 'المختلف' or text == 'مختلف' then
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,' ❂لا تستطيع استخدام البوت \n  ❂يرجى الاشتراك بالقناه اولا \n  ❂اشترك هنا ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
if database:get(bot_id..'Lock:Games'..msg.chat_id_) then
mktlf = {'😸','☠','🐼','🐇','??','🌚','⭐️','✨','⛈','🌥','⛄️','👨‍🔬','👨‍💻','👨‍🔧','👩‍🍳','🧚‍♀','??‍♂','??‍♂','🙍‍♂','🧖‍♂','👬','👨‍👨‍👧','🕒','🕤','⌛️','📅',};
name = mktlf[math.random(#mktlf)]
database:del(bot_id..'Set:Moktlf:Bot'..msg.chat_id_)
database:set(bot_id..':Set:Moktlf'..msg.chat_id_,name)
name = string.gsub(name,'😸','😹😹😹😹😹😹😹😹😸😹😹😹😹')
name = string.gsub(name,'☠','💀💀💀💀💀💀💀☠💀💀💀💀💀')
name = string.gsub(name,'🐼','👻👻👻🐼👻👻👻👻👻👻👻')
name = string.gsub(name,'🐇','🕊🕊🕊🕊🕊🐇🕊🕊🕊🕊')
name = string.gsub(name,'🌑','🌚🌚🌚🌚🌚🌑🌚🌚🌚')
name = string.gsub(name,'🌚','🌑🌑🌑🌑🌑🌚🌑🌑🌑')
name = string.gsub(name,'⭐️','🌟🌟🌟🌟🌟🌟🌟🌟⭐️🌟🌟🌟')
name = string.gsub(name,'✨','💫💫💫💫💫✨💫💫💫💫')
name = string.gsub(name,'⛈','🌨🌨🌨🌨🌨⛈🌨🌨🌨🌨')
name = string.gsub(name,'🌥','⛅️⛅️⛅️⛅️⛅️⛅️🌥⛅️⛅️⛅️⛅️')
name = string.gsub(name,'⛄️','☃☃☃☃☃☃⛄️☃☃☃☃')
name = string.gsub(name,'👨‍🔬','👩‍🔬👩‍🔬👩‍🔬👩‍🔬👩‍🔬👩‍🔬👩‍🔬👩‍🔬👨‍🔬👩‍🔬👩‍🔬👩‍🔬')
name = string.gsub(name,'👨‍💻','👩‍💻👩‍💻👩‍‍💻👩‍‍💻👩‍💻👨‍💻👩‍💻👩‍💻👩‍💻')
name = string.gsub(name,'👨‍🔧','👩‍🔧👩‍🔧👩‍🔧👩‍🔧👩‍🔧👩‍🔧👨‍🔧👩‍🔧')
name = string.gsub(name,'👩‍🍳','👨‍🍳👨‍🍳👨‍🍳👨‍🍳👨‍🍳👩‍🍳👨‍🍳👨‍🍳👨‍🍳')
name = string.gsub(name,'🧚‍♀','🧚‍♂🧚‍♂🧚‍♂🧚‍♂🧚‍♀🧚‍♂🧚‍♂')
name = string.gsub(name,'🧜‍♂','🧜‍♀🧜‍♀🧜‍♀🧜‍♀🧜‍♀🧚‍♂🧜‍♀🧜‍♀🧜‍♀')
name = string.gsub(name,'🧝‍♂','🧝‍♀🧝‍♀🧝‍♀🧝‍♀🧝‍♀🧝‍♂🧝‍♀🧝‍♀🧝‍♀')
name = string.gsub(name,'🙍‍♂️','🙎‍♂️🙎‍♂️🙎‍♂️🙎‍♂️🙎‍♂️🙍‍♂️🙎‍♂️🙎‍♂️🙎‍♂️')
name = string.gsub(name,'🧖‍♂️','🧖‍♀️🧖‍♀️🧖‍♀️🧖‍♀️🧖‍♀️🧖‍♂️🧖‍♀️🧖‍♀️🧖‍♀️🧖‍♀️')
name = string.gsub(name,'👬','👭👭👭👭👭👬👭👭👭')
name = string.gsub(name,'👨‍👨‍👧','👨‍👨‍👦👨‍👨‍👦👨‍👨‍👦👨‍👨‍👦👨‍👨‍👧👨‍👨‍👦👨‍👨‍👦')
name = string.gsub(name,'🕒','🕒🕒🕒🕒🕒🕒🕓🕒🕒🕒')
name = string.gsub(name,'🕤','🕥🕥🕥🕥🕥🕤🕥🕥🕥')
name = string.gsub(name,'⌛️','⏳⏳⏳⏳⏳⏳⌛️⏳⏳')
name = string.gsub(name,'📅','📆📆📆📆📆📆📅📆📆')
send(msg.chat_id_, msg.id_,' ❂اسرع واحد يدز الاختلاف » {'..name..'}')
return false
end
end
------------------------------------------------------------------------
if text == ''..(database:get(bot_id..':Set:Moktlf'..msg.chat_id_) or '')..'' then 
if not database:get(bot_id..'Set:Moktlf:Bot'..msg.chat_id_) then 
database:del(bot_id..':Set:Moktlf'..msg.chat_id_)
send(msg.chat_id_, msg.id_,' ❂الف مبروك لقد فزت \n ❂للعب مره اخره ارسل »{ المختلف }')
database:incrby(bot_id..'NUM:GAMES'..msg.chat_id_..msg.sender_user_id_, 1)  
end
database:set(bot_id..'Set:Moktlf:Bot'..msg.chat_id_,true)
end
------------------------------------------------------------------------
if text == 'الرياضيات' or text == 'رياضيات' then
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,' ❂لا تستطيع استخدام البوت \n  ❂يرجى الاشتراك بالقناه اولا \n  ❂اشترك هنا ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
if database:get(bot_id..'Lock:Games'..msg.chat_id_) then
Amer = {'22','30','33','60','90','2','5','36','16','88','50','10','19',};
name = Amer[math.random(#Amer)]
database:del(bot_id..'Set:Ryadeat:Bot'..msg.chat_id_)
database:set(bot_id..':Set:Ryadeat'..msg.chat_id_,name)
name = string.gsub(name,'22','2+20=')
name = string.gsub(name,'30','10×3=')
name = string.gsub(name,'33','30+3=')
name = string.gsub(name,'60','33+27=')
name = string.gsub(name,'90','9×9+9=')
name = string.gsub(name,'2','2×1=')
name = string.gsub(name,'5','5×1=')
name = string.gsub(name,'36','6×6=')
name = string.gsub(name,'16','2×8=')
name = string.gsub(name,'88','8+80=')
name = string.gsub(name,'50','30+20=')
name = string.gsub(name,'10','2+8=')
name = string.gsub(name,'19','6+13=')
send(msg.chat_id_, msg.id_,' ❂حل المسأله الرياضيه  » {'..name..'}')
return false
end
end
------------------------------------------------------------------------
if text == ''..(database:get(bot_id..':Set:Ryadeat'..msg.chat_id_) or '')..'' then 
if not database:get(bot_id..'Set:Ryadeat:Bot'..msg.chat_id_) then 
database:del(bot_id..':Set:Ryadeat'..msg.chat_id_)
send(msg.chat_id_, msg.id_,' ❂الف مبروك لقد فزت \n ❂للعب مره اخره ارسل »{ رياضيات }')
database:incrby(bot_id..'NUM:GAMES'..msg.chat_id_..msg.sender_user_id_, 1)  
end
database:set(bot_id..'Set:Ryadeat:Bot'..msg.chat_id_,true)
end
------------------------------------------------------------------------
if text == 'غنيلي' or text == 'غني' then
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,' ❂لا تستطيع استخدام البوت \n  ❂يرجى الاشتراك بالقناه اولا \n  ❂اشترك هنا ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
if database:get(bot_id..'Lock:Games'..msg.chat_id_) then
Amer =
 {'شكله مش موضوع بسيط .. فيه غدر وفيه حوارات
ده أنا بسهر بالساعات .. كل ده بيحصل أوام
حاسس إني كده إبتديت .. أبقي رومانسي و ضعیف
ليه نومي بقي خفيف .. كنت لما بنام بنام
الجمال عدي الكلام .. تضحكي لي و تاخدي كام
أدفع العمر اللي جاي .. بس و تردي السلام
مش بأفور صدقيني .. حس بيا كلميني
حتي لو موضوع غريب .. اللي طالبه تفهميني
ده أنا و الله إبن ناس .. مش بعاكس م الأساس
هتقوليلي ده اندفاع .. يمكن تستغربيني
أوعي تمشي و تسيبيني .. قبل ما أخلص كلام
أنا شفتك قلبي ضاع .. و ده أصلا مش طبيعي
في الزحمة لو تضيعي .. قولي علي قلبي السلام','انت معلم وحنا منك نتعلم
انت معلم وحنا منك نتعلم
نسكت ونتا موجود ما نرضى نتكلم
نسكت ونتا موجود ما نرضى نتكلم
انت معلم وحنا منك نتعلم
انت معلم وحنا منك نتعلم
آه نسكت ونتا موجود ما نرضى نتكلم
نسكت ونتا موجود ما نرضى نتكلم
والي خلاك ما يفهم يجيلو يوم و يندم
والي خلاك ما يفهم يجيلو يوم و يندم
وما تسمع الي يخدعك انت معلم
وما تسمع الي يخدعك انت معلم
انت معلم وحنا منك نتعلم (معلّم!)
انت معلم وحنا منك نتعلم
اه نسكت ونتا موجود ما نرضى نتكلم
نسكت ونتا موجود ما نرضى نتكلم','أنا قولت اللي محدش قاله
وعملت اللي محدش عمله
يفارقني أنا راضي ومالو
بكرة هيعرف غلطة عمره
هيعيش يفتكرني
وكل ما يقابل في بٌعدي هيفتكرني
يتمني بس انه يقابلني
هيعيش يفتكرني
وكل ما يقابل في بٌعدي هيفتكرني
يتمني بس انه يقابلني
خليه يشوف بقي مين أبقاله
ده أنا ياما عملت حساب زعله
أنا بعد كلامه وأفعاله
ده لا يمكن حاجة تشفعله
هيعيش يفتكرني
وكل ما يقابل في بٌعدي هيفتكرني
يتمني بس انه يقابلني
هيعيش يفتكرني
وكل ما يقابل في بٌعدي هيفتكرني
يتمني بس انه يقابلني
آه، آه، آه
آه، آه، آه
هيعيش يفتكرني
وكل ما يقابل في بٌعدي هيفتكرني
يتمني بس انه يقابلني
هيعيش يفتكرني
وكل ما يقابل في بٌعدي هيفتكرني
يتمني بس انه يقابلني','أنا قولت اللي محدش قاله
وعملت اللي محدش عمله
يفارقني أنا راضي ومالو
بكرة هيعرف غلطة عمره
هيعيش يفتكرني
وكل ما يقابل في بٌعدي هيفتكرني
يتمني بس انه يقابلني
هيعيش يفتكرني
وكل ما يقابل في بٌعدي هيفتكرني
يتمني بس انه يقابلني
خليه يشوف بقي مين أبقاله
ده أنا ياما عملت حساب زعله
أنا بعد كلامه وأفعاله
ده لا يمكن حاجة تشفعله
هيعيش يفتكرني
وكل ما يقابل في بٌعدي هيفتكرني
يتمني بس انه يقابلني
هيعيش يفتكرني
وكل ما يقابل في بٌعدي هيفتكرني
يتمني بس انه يقابلني
آه، آه، آه
آه، آه، آه
هيعيش يفتكرني
وكل ما يقابل في بٌعدي هيفتكرني
يتمني بس انه يقابلني
هيعيش يفتكرني
وكل ما يقابل في بٌعدي هيفتكرني
يتمني بس انه يقابلني','حبيبي بالبُنط العريض
غالي واقرب م الوريد
حالتي تتشخص جُنون
بيقولولي انا بيك مريض

أتاري كُل ما احب فيك
بدمنك وبقيت مزاج
أتلحق بقى دي ف إيديك
ما انت في لُقاك العلاج

آه لقيت الطبطبه
واقوى لو ما انتش بعيد
ضحكتك فيها كهربا
بابقى زي واحد جديد

حبيبي خدها ومني ليك
مشتريك آه مشتريك
فوق ما تتصور كمان
والوحيد ولا ليك شريك

لو انا هوصفك اوصف ايه
عُقد فُل ابيض وفيه
قلب بيدلدق حنان
مِـلكي بقى وانا أدرى بيه

آه لقيت الطبطبه
واقوى لو ما انتش بعيد
ضحكتك فيها كهربا
بابقى زي واحد جديد','سهرنا يا ليل
للصبح يا ليل
وأمانه ما تمشي يا قمر اليل أه يا محلى اليل ويا حبيبي
دي حياتي معاه
بقى ليها حياه
لو هفضل طول الليل حضناه مش هشبع من حضن حبيبي

استني يا شمس بقى استني
مش عايزه حبيبي يروح مني

ما تجيش وحياتك دلوقتي
اصل انا لسه ما خدتش وقتي
عايزه اسهر مره على طريقتي
واتهنى لحد الصبح معاه

استني يا شمس كمان حبه
محتاجه اني في حضنه اتخبى
وقف يا زمان ساعتك ليله
دي السهره بقت جنبو جميله
و حياتي ما جتش من الليله
دانا قلبي ما صدق يبقى معاه..

سهرنا يا ليل
للصبح يا ليل
و أمانه ما تمشي يا قمر اليل أه يا محلى اليل ويا حبيبي
هانغني يا ليل
للصبح يا ليل
و امانه ما تمشي يا قمر الليل
آه يا محلا الليل وياه حبيبي
دي حياتي معاه بقى ليها حياة
لو أفضل طول الليل حاضناه
مش هاشبع من حضن حبيبي

علشان خاطري بقا يا ليل طول
و يا ريت لو ترجع من أول
خليك سهران حبة معانا
الليله أنا أسعد إنسانه
لو هفضل مية ليل سهرانة
مش هتعب برضه ما دام حاضناه

وأمانه عليك آه يا ليل طول
وحياتنا لترجع من الأول
خليك سهران حبة معانا
الليلة أنا أجمل إنسانه
لو هفضل مية ليل سهرانة
مش هتعب برضو ما دام واياه

سهرنا يا ليل
للصبح يا ليل
و أمانه ما تمشي يا قمر اليل أه يا محلى اليل ويا حبيبي
علشان خاطري بقا يا ليل طول
و يا ريت لو ترجع من أول
خليك سهران حبة معانا
الليله أنا أسعد إنسانه
لو هفضل مية ليل سهرانة
مش هتعب برضه ما دام حاضناه','مفيش مرة تقربلي تطمني.. يللي حاببني ليه قلبك بيظلمني.. كل ما أحبك منك بتحرمني.. يبقى ده اسمه كلام.. عشان خاطري تكلمني تفهمني.. عرفني إيه يا حبيبي حصل مني.. إزاي يطاوعك قلبك تغيب عني.. وإحنا بينا غرام.. اّه ياناري وحنيني بفتكرك وانت ناسيني.. يا حبيبي على عيني أتعذب منه بعيني.. مفيش مرة تقربلي تطمني.. يللي حاببني ليه قلبك بيظلمني.. كل ما أحبك منك بتحرمني.. يبقى ده اسمه كلام.. هان عليك تنساني وتبقى أناني وترضى بجرحك فيا.. سهلة لو من غيرك كتر خيرك أنا ميهونش عليا.. مفيش مرة تقربلي تطمني.. يللي حاببني ليه قلبك بيظلمني.. يبقى ده اسمه كلام.. عشان خاطري تكلمني تفهمني.. عرفني إيه يا حبيبي حصل مني.. إزاي يطاوعك قلبك تغيب عني.. وإحنا بينا غرام.. اّه ياناري وحنيني أفتكرك وانت ناسيني.. يا حبيبي على عيني أتعذب منه بعيني..','ياحبيبى اهو بقلها بكل اللهجات
وبعلو الصوت ولو عايزني اخترعلك لهجة
حبيبى انا جاهز موت
هلبا هلبا برشا برشا مرة مرة كتير كتير بزاف وايد اوي اوي

انا نبغيك ونموت عليك رب يخليك علطول ليا
وهلا والله يا يا بعد عمري يا محلى الحياة بقربك ياقمرى
انا نبغيك تكوني حلالي ونموت عليك حبيبة ديالي رب يخليك علطول ليا
وهلا والله يا يا بعد عمري فى بيتك يا محلى الحياة بقربك ياقمري

ياحبيبى اهو بقلها بكل اللهجات
وبعلو الصوت ولو عايزني اخترعلك لهجة
حبيبى انا جاهز موت
انا قلتهالك وهفضل تاني اقلهالك
انا وانت هنبقى حكاية الناس تحكيها في كل مكان
هلبا هلبا برشا برشا مرة مرة كتير كتير بزاف وايد اوي اوي

دخيله الله يا الله شو بحبه والله عجماله اسماالله يأبرنى هواه
ايش لونك حبى اشتاق ليك قلبى يادمى وشهدى قاتلنى جفاه
دخيله الله يا الله شو بحبه والله يادلي عجماله اسماالله يأبرنى هواه
شلونك حبي احبك اشتاق الك قلبي ياغزالي يادمي وتشهدين قاتلني جفاه

ياحبيبى اهو بقلها بكل اللهجات
وبعلو الصوت ولو عايزني اخترعلك لهجة
حبيبى انا جاهز موت
انا قلتهالك وهفضل تاني اقلهالك
انا وانت هنبقى حكاية الناس تحكيها في كل مكان
هلبا هلبا برشا برشا مرة مرة كتير كتير بزاف وايد اوي اوي','اعلم','ذئب','مالك مش باين ليه
قلبك تايه من مده كبيره
خايف تتكلم ليه
في عيونك حيره وحكاوي كتيره
متغير ياما عن زمان
قافل على قلبك البيبان
حبيت وفارقت كم مكان
عايش جواك
إحساسك كل يوم يقل
وتخطي وخطوتك تذل
من كتر ما أحبطوك تمل فين تلق دواك
بتودع حلم كل يوم
تستفرد بيك الهموم
وكله كوم والغربة كوم والجرح كبير
مبتديش حاجة اهتمام
أهلاً أهلاً سلام سلام
بقى طبعك قلة الكلام ومفيش تفسير

داري داري يا قلبي مهما تداري
قصاد الناس حزننا مكشوف
واهو عادي عادي محدش في الدنيا دي
بيتعلق بشيء إلا وفراقه يشوف
كل اللي معاك في الصورة غاب
وطنك والأهل والصحاب
كم واحد ودع وساب من غير أسباب
شايف في عينيك نظرة حنين بتحن لمين ولا مين
طول عمرها ماشيه السنين والناس ركاب
مع دقة عقرب الساعات
بتموت جوانا ذكريات
عشمنا قلوبنا باللي فات ونسينا نعيش
كان مكتوب نمشي الطريق ونفارق كل مدى شيء
اتسرق العمر بالبطيء ورسي على مافيش
ودارَيْ دارَيْ يا قَلْبَيْ مُهِمّا تُدارِي
قُصّاد الناس حزْننا مَكْشُوف
وَأاهْوَ عادِي عادِي محدش فِيَّ الدُنْيا دِي
بيتَعَلَّق بِشَيّء إِلّا وَفِراقهُ يُشَوِّف

داري داري يا قلبي مهما تداري
قصاد الناس حزننا مكشوف
واهو عادي عادي محدش في الدنيا دي
بيتعلق بشيء إلا وفراقه يشوف
وداري داري يا قلبي مهما تداري
قصاد الناس حزننا مكشوف
واهو عادي عادي محدش في الدنيا دي
بيتعلق بشيء إلا وفراقه يشوف
داري داري يا قلبي مهما تداري
قصاد الناس حزننا مكشوف','ذكي',};
name = Amer[math.random(#Amer)]
database:del(bot_id..'Set:English:Bot'..msg.chat_id_)
database:set(bot_id..':Set:English'..msg.chat_id_,name)
name = string.gsub(name,'ذئب','Wolf')
name = string.gsub(name,'معلومات','Information')
name = string.gsub(name,'قنوات','Channels')
name = string.gsub(name,'مجموعات','Groups')
name = string.gsub(name,'كتاب','Book')
name = string.gsub(name,'تفاحه','Apple')
name = string.gsub(name,'سدني','Sydney')
name = string.gsub(name,'فلوس','money')
name = string.gsub(name,'اعلم','I know')
name = string.gsub(name,'تمساح','crocodile')
name = string.gsub(name,'مختلف','Different')
name = string.gsub(name,'ذكي','Intelligent')
send(msg.chat_id_, msg.id_,' ❂ترجم الكلمات الاتيه  » {'..name..'}')
return false
end
end
------------------------------------------------------------------------
if text == ''..(database:get(bot_id..':Set:English'..msg.chat_id_) or '')..'' then 
if not database:get(bot_id..'Set:English:Bot'..msg.chat_id_) then 
database:del(bot_id..':Set:English'..msg.chat_id_)
send(msg.chat_id_, msg.id_,' ❂الف مبروك لقد فزت \n ❂للعب مره اخره ارسل »{ `انكليزي` }')
database:incrby(bot_id..'NUM:GAMES'..msg.chat_id_..msg.sender_user_id_, 1)  
end
database:set(bot_id..'Set:English:Bot'..msg.chat_id_,true)
end
------------------------------------------------------------------------
if text == 'امثله' or text == 'الامثله' then
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,' ❂لا تستطيع استخدام البوت \n  ❂يرجى الاشتراك بالقناه اولا \n  ❂اشترك هنا ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
if database:get(bot_id..'Lock:Games'..msg.chat_id_) then
mthal = {'جوز','ضراطه','الحبل','الحافي','شقره','بيدك','سلايه','النخله','الخيل','حداد','المبلل','يركص','قرد','العنب','العمه','الخبز','بالحصاد','شهر','شكه','يكحله',};
name = mthal[math.random(#mthal)]
database:set(bot_id..'Set:Amth'..msg.chat_id_,name)
database:del(bot_id..'Set:Amth:Bot'..msg.chat_id_)
name = string.gsub(name,'جوز','ينطي____للماعده سنون')
name = string.gsub(name,'ضراطه','الي يسوق المطي يتحمل___')
name = string.gsub(name,'بيدك','اكل___محد يفيدك')
name = string.gsub(name,'الحافي','تجدي من___نعال')
name = string.gsub(name,'شقره','مع الخيل يا___')
name = string.gsub(name,'النخله','الطول طول___والعقل عقل الصخلة')
name = string.gsub(name,'سلايه','بالوجه امراية وبالظهر___')
name = string.gsub(name,'الخيل','من قلة___شدو على الچلاب سروج')
name = string.gsub(name,'حداد','موكل من صخم وجهه كال آني___')
name = string.gsub(name,'المبلل','___ما يخاف من المطر')
name = string.gsub(name,'الحبل','اللي تلدغة الحية يخاف من جرة___')
name = string.gsub(name,'يركص','المايعرف___يكول الكاع عوجه')
name = string.gsub(name,'العنب','المايلوح___يكول حامض')
name = string.gsub(name,'العمه','___إذا حبت الچنة ابليس يدخل الجنة')
name = string.gsub(name,'الخبز','انطي___للخباز حتى لو ياكل نصه')
name = string.gsub(name,'باحصاد','اسمة___ومنجله مكسور')
name = string.gsub(name,'شهر','امشي__ولا تعبر نهر')
name = string.gsub(name,'شكه','يامن تعب يامن__يا من على الحاضر لكة')
name = string.gsub(name,'القرد','__بعين امه غزال')
name = string.gsub(name,'يكحله','اجه___عماها')
send(msg.chat_id_, msg.id_,' ❂اسرع واحد يكمل المثل » {'..name..'}')
return false
end
end
------------------------------------------------------------------------
if text == ''..(database:get(bot_id..'Set:Amth'..msg.chat_id_) or '')..'' then 
if not database:get(bot_id..'Set:Amth:Bot'..msg.chat_id_) then 
database:del(bot_id..'Set:Amth'..msg.chat_id_)
send(msg.chat_id_, msg.id_,' ❂الف مبروك لقد فزت \n ❂للعب مره اخره ارسل »{ امثله }')
database:incrby(bot_id..'NUM:GAMES'..msg.chat_id_..msg.sender_user_id_, 1)  
end
database:set(bot_id..'Set:Amth:Bot'..msg.chat_id_,true)
end
if text == 'تعطيل الالعاب' and Manager(msg) then   
if database:get(bot_id..'Lock:Games'..msg.chat_id_)  then
database:del(bot_id..'Lock:Games'..msg.chat_id_) 
Text = '\n ❂ تم تعطيل الالعاب' 
else
Text = '\n ❂ بالتاكيد تم تعطيل الالعاب'
end
send(msg.chat_id_, msg.id_,Text) 
end
if text == 'تفعيل الالعاب' and Manager(msg) then  
if not database:get(bot_id..'Lock:Games'..msg.chat_id_)  then
database:set(bot_id..'Lock:Games'..msg.chat_id_,true) 
Text = '\n ❂ تم تفعيل الالعاب' 
else
Text = '\n ❂ بالتاكيد تم تفعيل الالعاب'
end
send(msg.chat_id_, msg.id_,Text) 
end

end
return {
Poyka = games
}